//
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// Потрібно зробити перевірку якщо кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення
// про те,що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//
// if (friends.length >= 3) {
//     console.log("Це великий масив в якому 3 або більше елементів");
// }else if (friends.length < 3) {
//     console.log("Це малий масив в якому менше 3 елементів");
// }
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше).
//     Перевірити, чи знаходиться перше число між двома іншими.
//                         a   b   c
// let a = +prompt('Введіть перше число');
// let b = +prompt('Введіть друге число');
// let c = +prompt('Введіть третє число');
// if (a > b && a < c || a < c && a > b) {
//     console.log(a, 'Перше число середнє');
// } else if (b > a && b < c || b > c && b < a) {
//     console.log(b, 'Друге число середнє');
// } else {
//     console.log(c, 'Третє число середнє')
// }



// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
// let a = +prompt('Enter the number "a"');
// let b = +prompt('Enter the number "b"');
//   result= a + b < 4 ? console.log("Мало") : console.log( "Багато");
//
//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let numRandom = Math.round(Math.random() * 100 || Math.random() * -100);
// numRandom > -100 && !==0 ? console.log(numRandom,'Негативне'):