// Всі функції повинні бути описані стрілочним типом!!!!
// - створити функцію яка обчислює та повертає площу прямокутника

// let sOctagon = (a, b) => a * b;
// console.log(sOctagon(10,30))
// ---------------------------------------------------------------------------------------------------------------------

// - створити функцію яка обчислює та повертає площу кола
// let sCircle = (r, pi = 3.14) => Math.pow(r, 2) * pi;
// console.log(sCircle(20))

// ---------------------------------------------------------------------------------------------------------------------

// - створити функцію яка обчислює та повертає площу циліндру

// let sCylinder = (r, h, pi = (3.14)) => 2*pi * r * h;
// console.log(sCylinder(10, 25,));
// ---------------------------------------------------------------------------------------------------------------------

// - створити функцію яка приймає масив та виводить кожен його елемент
// let arr = [1,2,3]
// let ell = (arr)=>{
//     for (let arrElement of arr) {
//         console.log(arrElement)
//     }
// }
// ell(arr)
// ---------------------------------------------------------------------------------------------------------------------

// - створити функцію яка  створює параграф з текстом. Текст задати через аргумент

// let pText = (arg) => {
//     document.write(`<p>${arg}</p>`);
// }
// pText('Hello')
// ---------------------------------------------------------------------------------------------------------------------


// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// let element = (arg,) =>{
//     document.write(`<ul>`)
//     for (let i = 0; i < 3 ; i++) {
//         document.write(`<li>${arg}</li>`)
//     }
//     document.write(`</ul>`)
// }
// element('OMG')
// ---------------------------------------------------------------------------------------------------------------------

// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// let text = (arg,size) =>{
//     document.write(`<ul>`)
//     for (let i = 0; i < size; i++) {
//         document.write(`<li>${arg}</li>`)
//     }
//     document.write(`</ul>`)
//     }
//     text("WTF",3)
// ---------------------------------------------------------------------------------------------------------------------

// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// let arr =[1,3,'hi', true, false, "wow"]
// let primitive = (arr) =>{
//     document.write(`<ul>`)
//     for (let arrElement of arr) {
//         document.write(`<li>${arrElement}</li>`)
//     }
//     document.write(`</ul>`)
// }
// primitive(arr)
// ---------------------------------------------------------------------------------------------------------------------

// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ
// . Для кожного об'єкту окремий блок.
// let users = [
//     {id: 1, name: 'Olga', age: 25},
//     {id: 2, name: 'Ira', age: 21},
//     {id: 3, name: 'Tania', age: 19}
//
//             ];
// let arrObj = (arr) =>{
//     for (const arrElement of arr) {
//         document.write(`<div>${arrElement.id} ${arrElement.name} ${arrElement.age}</div>`)
//     }
// }
// arrObj(users)