// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let nam = +prompt("Enter any two numbers:")
// if (nam)
// console.log(nam);

//
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let flat = +prompt('Enter the apartment number')
// if (flat <=20) {
//     document.write(`<h1>'This apartment in located in the first entrance.'</h1>`);
// }else if (flat <=48) {
//     document.write(`<h1>'This apartment in located in the second entrance.'</h1>`);
// }else if (flat <=90) {
// document.write(`<h1>'This apartment in located in the third entrance.'</h1>`);
// }else {
//     document.write(`<h1>'You didn't get there.'</h1>`)
// }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Заишіть числове знакення щоб отримати число 10')
// if (number === 10){
//     document.write(`<h1>"Вірно!"</h1>`);
// }else {
//     document.write(`<h1>"Не вірно!"</h1>`)
// }

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = undefined
// if (typeof x ==='number'){
//     document.write('1')
// }else if (typeof x === 'string') {
//     document.write('2');
// }else if (typeof x === 'boolean' || typeof x ==='object') {
//     document.write('3')
// }else
//     document.write('else');
//


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temperature = +prompt("Яка температура повітря?");
// if (temperature >= +10 && temperature <= +22) {
//     console.log('Ми йдемо вчитись!');
// } else {
//     console.log('Сидимо вдома і вчимося ОНЛАЙН');
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let num = +prompt('Введіть число від 1 до 5')
// switch (num) {
//     case 1:
//         console.log( 'Ви виграли автомобіль Жига5-ка!')
//         break;
//     case 2:
//         console.log('Вивиграли телефон Афон5-ка!');
//         break
//     case 3:
//         console.log('Ви виграли мотоцикл!');
//         break
//     case 4:
//         console.log('Ви виграли тапки!')
//         break
//     case 5:
//         console.log('Ви виграли покупон!');
//         break;
//     default:
//         console.log('Число введене не вірно!');
// }




















































