    // 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor).
    // Скласти результат цих чисел в змінній result.
    // let arr = [];
    // for (let i = 0; i < 10; i++) {
    //     arr.push(Math.floor(Math.random() * 10));
    // }
    // console.log(arr)
    // let result = 0;
    // for (let i = 0; i < arr.length; i++) {
    //     result += arr[i];
    // }
    // console.log(result)
    // 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
    // let book = {
    //     name: 'Найбагатший чоловік у Вавилоні',
    //     numPages: 136,
    //     genre: 'бізнес'
    // }
    // 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
    // let book = {
    //     name: 'Мислення швидке й повільне',
    //     numPage: 480,
    //     genre: 'Мотиваційна література',
    //     authors: 'Даніел Канеман'
    // }

    // 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори.
    // Вивести кожну книгу як окремий об'єкт

    // let books = [
    //     {
    //         name: 'Найбагатший чоловік у Вавилоні',
    //         numPages: 136,
    //         genre: 'бізнес',
    //         author: 'Джордж Клейсон'
    //     },
    //     {
    //         name: 'Мислення швидке й повільне',
    //         numPage: 480,
    //         genre: 'Мотиваційна література',
    //         authors: 'Даніел Канеман'
    //     },{
    //         name: 'Абрикосова книгарня',
    //         numPage: 240,
    //         genre: 'Художня література',
    //         authors: 'Ореста Осійчук'
    //     }
    // ];
    // console.log(books)

    // 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
    // Значення площі зберігати в змінній s.
    // let height = 23;
    // let width = 10;
    // let s = (height * width);
    // console.log(s)

    // 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
    // результат помістіть у змінну v.

    // let heightC = 10;
    // let diameterC = 4;
    // let vC = 3.14 * (heightC * diameterC);
    // console.log(vC)
    // 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
    // Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
    //
    // let n = 3;
    // let m = 4;
    // let k = Math.sqrt(Math.pow(n, 2) + Math.pow(m, 2));
    // console.log(k)